Tekla Open API Reference for Tekla Structures 2025
MarkBase.MoveObjectRelative Method
 Moves the object using the move vector.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MoveObjectRelative(
	Vector MoveVector
)
Public Function MoveObjectRelative (
	MoveVector As Vector
) As Boolean
Parameters
MoveVector
Type: Tekla.Structures.Geometry3d.Vector
The move vector to be used.
Return Value
Type: Boolean
True.
Implements
IMovableRelative.MoveObjectRelative(Vector)
See Also
Reference
MarkBase Class
Tekla.Structures.Drawing Namespace